In [2]:
import sys
print(sys.version)
from os import path
from wordcloud import WordCloud
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

3.5.2 |Anaconda 4.2.0 (x86_64)| (default, Jul  2 2016, 17:52:12)
[GCC 4.2.1 Compatible Apple LLVM 4.2 (clang-425.0.28)]

In [7]:
df = pd.read_csv("../ShahAli.csv")
df.head()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
0,5702.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,6,2001,176.0
1,5871.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,9,2001,200.0
2,5904.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,10,2001,220.0
3,5916.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,8,2001,214.0
4,6041.0,PAIKPARA GOVT STAFF QTR,29000041,1068554,"BLD-129/10 MIRPUR, DHAKA",SAAA,100,10.0,2,A,Child,12,2001,149.0

In [8]:
df.tail()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
4550013,11034.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,5,2016,4271.0
4550014,11144.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,6,2016,4219.0
4550015,11271.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,7,2016,4363.0
4550016,11461.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,8,2016,4934.0
4550017,11506.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"House/Flat # 1/D, Road # 9/1, Block # A, Secti...",SAFP,100,180.01,2,E,Single,9,2016,4555.0

In [9]:
df.ADDRESS = df.ADDRESS.apply(lambda x: x.upper())
df.tail()

,SL,NAME,ACCOUNT_NO,METER_NO,ADDRESS,ZONE,BLOCK,ROUTE,LOAD,TARIFF,METER_STATUS,MONTH,YEAR,UNIT
4550013,11034.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,5,2016,4271.0
4550014,11144.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,6,2016,4219.0
4550015,11271.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,7,2016,4363.0
4550016,11461.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,8,2016,4934.0
4550017,11506.0,MD.SHAKAWAT HOSSAIN,31518379,14391192,"HOUSE/FLAT # 1/D, ROAD # 9/1, BLOCK # A, SECTI...",SAFP,100,180.01,2,E,Single,9,2016,4555.0

In [10]:
df.isnull().sum()

SL              11792
NAME                0
ACCOUNT_NO          0
METER_NO         1023
ADDRESS             0
ZONE                0
BLOCK               0
ROUTE               0
LOAD                0
TARIFF              0
METER_STATUS       47
MONTH               0
YEAR                0
UNIT                0
dtype: int64

In [12]:
df = df.dropna()
df.isnull().sum()

SL              0
NAME            0
ACCOUNT_NO      0
METER_NO        0
ADDRESS         0
ZONE            0
BLOCK           0
ROUTE           0
LOAD            0
TARIFF          0
METER_STATUS    0
MONTH           0
YEAR            0
UNIT            0
dtype: int64

In [22]:
columns = ['METER_NO','ADDRESS','ZONE','BLOCK','ROUTE']
droped_duplicates_df = df.drop_duplicates(['METER_NO'])
droped_duplicates_df.count()

SL              63492
NAME            63492
ACCOUNT_NO      63492
METER_NO        63492
ADDRESS         63492
ZONE            63492
BLOCK           63492
ROUTE           63492
LOAD            63492
TARIFF          63492
METER_STATUS    63492
MONTH           63492
YEAR            63492
UNIT            63492
dtype: int64

In [20]:
droped_duplicates_df.to_csv("../shahali_dropna_only_addresses.csv",index=False,columns=columns)

In [23]:
import re

In [24]:
import gmaps

In [3]:
df = pd.read_csv("../shahali_dropna_only_addresses.csv")
df.head()

  METER_NO                   ADDRESS  ZONE  BLOCK  ROUTE
0  1068554  BLD-129/10 MIRPUR, DHAKA  SAAA    100  10.00
1  1068779   BLD-129/7 MIRPUR, DHAKA  SAAA    100  80.00
2  1068177   BLD-129/3 MIRPUR, DHAKA  SAAA    100  30.01
3  1155509   BLD-129/4 MIRPUR, DHAKA  SAAA    100  40.00
4  1068179   BLD-129/1 MIRPUR, DHAKA  SAAA    100  50.00

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20642 entries, 0 to 20641
Data columns (total 5 columns):
METER_NO    20642 non-null object
ADDRESS     20642 non-null object
ZONE        20642 non-null object
BLOCK       20642 non-null int64
ROUTE       20642 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 806.4+ KB

In [5]:
df.BLOCK.value_counts()

100    789
190    753
130    635
210    581
200    533
230    490
220    468
110    434
180    430
120    423
310    420
150    412
240    401
290    383
140    381
160    380
50     371
30     364
170    353
260    310
40     308
430    300
300    296
10     293
270    291
777    287
340    266
125    237
90     225
225    218
      ...
141     76
196     75
365     75
202     72
145     72
360     72
263     70
450     69
156     68
333     67
262     67
295     66
221     66
332     65
164     64
540     60
245     57
206     57
286     57
782     57
205     54
192     53
520     46
400     43
195     36
331     35
207     34
191     31
521     29
545      5
Name: BLOCK, dtype: int64

In [8]:
un_block = df.BLOCK.unique()
un_block.size

113

In [16]:
un_zone = df.ZONE.unique()
un_zone.size

11

In [17]:
un_route = df.ROUTE.unique()
un_route.size

2775

In [18]:
df.dtypes

METER_NO     object
ADDRESS      object
ZONE         object
BLOCK         int64
ROUTE       float64
dtype: object

In [19]:
df.ZONE = df.ZONE.astype('category')
df.dtypes

METER_NO      object
ADDRESS       object
ZONE        category
BLOCK          int64
ROUTE        float64
dtype: object

In [21]:
df.BLOCK = df.BLOCK.astype('category')
df.dtypes

METER_NO      object
ADDRESS       object
ZONE        category
BLOCK       category
ROUTE        float64
dtype: object